from colorama import init
from colorama import Fore, Style

init()


RED = Fore.LIGHTRED_EX
GREEN = Fore.LIGHTGREEN_EX
YELLOW = Fore.LIGHTYELLOW_EX
# RED = Fore.RED
# GREEN = Fore.GREEN
# YELLOW = Fore.YELLOW
RESET = Style.RESET_ALL


class InfoReports(object):
    FOLDER_EXIST = 'FOLDER_EXIST'
    FOLDER_CREATED = 'FOLDER_CREATED'
    CREATE_FOLDER = 'CREATE_FOLDER'
    FOLDER_NOT_EXIST = 'FOLDER_NOT_EXIST'
    NO_CONTENT_IN_FOLDER = 'NO_CONTENT_IN_FOLDER'
    COPY_FOLDER = 'COPY_FOLDER'
    CHECK_FOLDER_CONTENT = 'CHECK_FOLDER_CONTENT'
    FOLDER_CONTENT = 'FOLDER_CONTENT'
    DONT_TOUCH = 'DONT_TOUCH'
    SETTING_INCORRECT = 'SETTING_INCORRECT'
    PRECONDITION = 'PRECONDITION'
    ABOUT = 'ABOUT'
    INFO_ABOUT_PATH = 'INFO_ABOUT_PATH'
    PATH_NOT_CORRECT = 'PATH_NOT_CORRECT'
    CHANGE_CATALOG = 'CHANGE_CATALOG'


def report(name_report, name_folder='', color=RESET):
    if name_report == 'FOLDER_EXIST':
        print(f'КАТАЛОГ {color}{name_folder}{RESET} СУЩЕСТВУЕТ!')

    elif name_report == 'FOLDER_CREATED':
        print(f'КАТАЛОГ {color}{name_folder}{RESET} СОЗДАН!')

    elif name_report == 'CREATE_FOLDER':
        print(f'СОЗДАЕМ КАТАЛОГ {color}{name_folder}{RESET}!')

    elif name_report == 'FOLDER_NOT_EXIST':
        print(f'КАТАЛОГА {color}{name_folder}{RESET} НЕ СУЩЕСТВУЕТ!')

    elif name_report == 'NO_CONTENT_IN_FOLDER':
        print(f'В КАТАЛОГЕ {color}{name_folder}{RESET} ОТСУТСТВУЕТ СОДЕРЖИМОЕ!')

    elif name_report == 'COPY_FOLDER':
        print(f'{color}КОПИРУЕМ СОДЕРЖИМОЕ КАТАЛОГА {name_folder}{RESET}.')

    elif name_report == 'CHECK_FOLDER_CONTENT':
        print(f'ПРОВЕРЯЕМ СОДЕРЖИМОЕ КАТАЛОГА {color}{name_folder}{RESET}.')

    elif name_report == 'FOLDER_CONTENT':
        print(f'{color}СОДЕРЖИМОЕ КАТАЛОГА {name_folder}:{RESET}')

    elif name_report == 'DONT_TOUCH':
        print(f'''{color}НИЧЕГО НЕ ТРОГАЙ ДО ТЕХ ПОР,
ПОКА ЧЕКАЛКА НЕ ЗАПУСТИТСЯ АВТОМАТИЧЕСКИ!{RESET}''')

    elif name_report == 'SETTING_INCORRECT':
        print(f'''{color}ПРЕДНАСТРОЙКА БЫЛА ВЫПОЛНЕНА НЕКОРРЕКТНО,
ВОЗМОЖНО БЫЛИ ЗАПОЛНЕНЫ НЕ ВСЕ ПОЛЯ,
ПЕРЕЗАПУСТИ ПРОГРАММУ{RESET}''')

    elif name_report == 'PRECONDITION':
        print(f'''{Fore.YELLOW}СЕЙЧАС БУДЕМ ПРОВОДИТЬ ПРЕДВАРИТЕЛЬНУЮ НАСТРОЙКУ,
ВСЕГДА МОЖНО ИЗМЕНИТЬ В ФАЙЛЕ MY_TUNING.TXT{RESET}\n''')

    elif name_report == 'ABOUT':
        print(f'{color}ПРОГРАММА ДЛЯ ПОМОЩИ ПРИ ВЫКЛАДКЕ КАТАЛОГА.                                                             © Меньшиков В.С.{RESET}')

    elif name_report == 'INFO_ABOUT_PATH':
        print(f'''
╔======================================================================================================================╗
║ {YELLOW}ДЛЯ СПРАВКИ:{RESET}                                                                                                         ║
║ {YELLOW}ПУТЬ К КАТАЛОГУ ДОЛЖЕН СТРОГО СООТВЕТСТВОВАТЬ ФОРМАТУ:{RESET}                                                               ║
║ {RED}\\\\PUMBA\\BFT\\СХЕМЫ\\DISTRIB\\57_DEV_IBS\\REPS\\ГГГГ_ММ_ММ\\НОМЕР_ФАМИЛИЯ РАЗРАБОТЧИКА{RESET}                                      ║
║                                                                                                                      ║
║ {YELLOW}НАПРИМЕР:{RESET}                                                                                                            ║
║                                                                                                                      ║
║ {RED}\\\\PUMBA\\BFT\\СХЕМЫ\\DISTRIB\\57_DEV_IBS\\REPS\\2019_08_14\\01_ivanov{RESET}                                                       ║
║                                                                                                                      ║
║ В ТАКОМ ФОРМАТЕ ПУТИ ХРАНЯТСЯ В ПРОТОКОЛЕ ТЕСТИРОВАНИЯ НА СТРАНИЦЕ {YELLOW}<<Информация>>{RESET}                                    ║
║ {YELLOW}ПОЭТОМУ СКОПИРУЙ ПУТЬ ИЗ ПРОТОКОЛА!{RESET}                                                                                  ║
╚======================================================================================================================╝''')

    elif name_report == 'PATH_NOT_CORRECT':
        print(f'{color}ПУТЬ К КАТАЛОГУ НЕ СООТВЕТСТВУЕТ ФОРМАТУ! ПОПРОБУЙ СНОВА!{RESET}')

    elif name_report == 'CHANGE_CATALOG':
        print(f'{color}УКАЖИ ПУТЬ К КАТАЛОГУ:{RESET}')


class Checks(object):
    CHECK1 = f'''
╔======================================================================================================================╗
║{YELLOW}                                        РАЗРАБОТЧИК АКТУАЛИЗИРОВАЛ ХРАНИЛИЩЕ?{RESET}                                         ║
╚======================================================================================================================╝'''

    CHECK2 = f'''
╔======================================================================================================================╗
║{YELLOW} КАТАЛОГ ДОЛЖЕН СОДЕРЖАТЬ:{RESET}                                                                                            ║
║    - Файл хранилища (ibsobj*.mdb)                                                                                    ║
║    - Описание изменений (ibsobj*.pck)                                                                                ║
║    - При наличии конвертации:                                                                                        ║
║        - Описание операций конвертации.xlsx                                                                          ║
║        - Инструкция по установке.txt                                                                                 ║
║    - При изменении шаблона отчета                                                                                    ║
║        - Папка DATA с новым шаблоном                                                                                 ║
║    - При удалении сущностей (операций, библиотек и т.д.) со схемы                                                    ║ 
║        - (delete*.pck)                                                                                               ║
╚======================================================================================================================╝'''

    CHECK3 = f'''
╔======================================================================================================================╗
║{YELLOW}                                         СОДЕРЖИМОЕ КАТАЛОГА СООТВЕТСТВУЕТ?{RESET}                                           ║
╚======================================================================================================================╝'''

    CHECK4 = f'''
╔======================================================================================================================╗
║{YELLOW}                                          ПРОВЕРИЛ ОФОРМЛЕНИЕ ЗАЯВКИ В АТМ?{RESET}                                           ║
║{YELLOW}- PUBLIC INFO{RESET}                                                                                                         ║
║    - "ОПИСАНИЕ ПРОБЛЕМЫ" заполняет аналитик                                                                          ║
║    - "РЕАЛИЗАЦИЯ" заполняет разработчик                                                                              ║
║    - "ОПИСАНИЕ ДЛЯ КАТАЛОГА" заполняет аналитик (только для заявок типа "Доработка")                                 ║
║{YELLOW}- ПРОДУКТ {RESET}(Все поля (кроме "версия, в которой обнаружена проблема")                                                   ║
║            обязательны к заполнению. В случае затруднений обратиться                                                 ║
║            к аналитику или разработчику)                                                                             ║
║{YELLOW}- НОВАЯ ВОЗМОЖНОСТЬ (только у доработок){RESET}:                                                                             ║
║    - Вкладки "Основное", "Суть" и "Инфо для пользователя"                                                            ║
║      (ссылки на пользовательскую документацию) заполняются аналитиком                                                ║
║    - "Инфо для администратора", "При установке обновления" и "Настройка"                                             ║
║       заполняются разработчиком                                                                                      ║
║    - Задача "Проверка НВ" должна быть закрыта                                                                        ║
╚======================================================================================================================╝'''

    CHECK5 = f'''
╔======================================================================================================================╗
║{YELLOW}                              ДЛЯ ЗАЯВОК ТИПА "ДЕФЕКТ" ВЫПОЛНЕН АНАЛИЗ ПРИЧИНЫ ДЕФЕКТА?{RESET}                               ║
║{YELLOW}- РАЗРАБОТЧИК ЗАПОЛНЯЕТ:{RESET}                                                                                              ║
║    - поле "Этап разработки, в котором возникла ошибка"                                                               ║
║    - поле "Заявка, в которой допущена ошибка"                                                                        ║
║    - блок "Причина ошибки"                                                                                           ║
║    - блок "Предложения по возможным мероприятиям, которые позволят избежать такой ошибки в будущем"                  ║
║{YELLOW}- ТЕСТИРОВЩИК ЗАПОЛНЯЕТ:{RESET}                                                                                              ║
║    - поле "Типизированная причина"                                                                                   ║
║    - дополняет "Предложения по возможным мероприятиям, которые позволят избежать такой ошибки в будущем"             ║
║        {YELLOW}*** при необходимости внести информацию в Чек-листы или Чит-листы{RESET}                                             ║
╚======================================================================================================================╝'''

    CHECK6 = f'''
╔======================================================================================================================╗
║{YELLOW}                                            ДОКУМЕНТАЦИЯ МЕНЯЛАСЬ?{RESET}                                                    ║
║- Проверить внесение изменений в документацию (изменения вносят аналитики или тестировщики)                           ║
║{YELLOW}    *** Важно! Если по какой-то причине заявка не выходит в планируемую версию,{RESET}                                       ║ 
║{YELLOW}        проконтролировать, чтобы откатили ранее внесенные изменения в документацию к версии{RESET}                           ║
╚======================================================================================================================╝'''

    CHECK7 = f'''
╔======================================================================================================================╗
║{YELLOW}                                  ЗАДАЧИ С БОЛЕЕ ВЫСОКИМ ПРИОРИТЕТОМ ЗАКРЫТЫ?{RESET}                                         ║
╚======================================================================================================================╝'''

    CHECK8 = f'''
╔======================================================================================================================╗
║{YELLOW}                                        КОПИРУЕМ ДЛЯ ПРОВЕРКИ ЧЕКАЛКОЙ?{RESET}                                               ║
╚======================================================================================================================╝'''

    CHECK9 = f'''
╔======================================================================================================================╗
║{YELLOW}                     КОПИРУЕМ ПО РЕЗУЛЬТАТАМ АВТОМАТИЧЕСКОЙ ПРОВЕРКИ ИЛИ ВСЕ СОДЕРЖИМОЕ?{RESET}                              ║
╚======================================================================================================================╝'''

    CHECK10 = f'''
╔======================================================================================================================╗
║{YELLOW}                                ЧЕКАЛКА ПРОШЛА УСПЕШНО? КОПИРУЕМ НА ДИСТРИБУТИВ?{RESET}                                      ║
╚======================================================================================================================╝'''

    CONGRATULATION = f'''
╔======================================================================================================================╗
║{GREEN}                                    ТЫ МОЛОДЕЦ! ПОЗДРАВЛЯЮ ВЫКЛАДКА ЗАВЕРШЕНА!{RESET}                                        ║
║ {YELLOW}ВНИМАНИЕ!{RESET}                                                                                                            ║
║    - ПАПКА С ВЫЛОЖЕННЫМ КАТАЛОГОМ ОТКРОЕТСЯ АВТОМАТИЧЕСКИ                                                            ║
║    - ПРОВЕРЬ ЕЩЕ РАЗ ГЛАЗАМИ СОДЕРЖИМОЕ ВЫЛОЖЕННОГО КАТАЛОГА                                                         ║
║    - ЕСЛИ ПРИСУТСТВУЮТ ЛИШНИЕ ФАЙЛЫ И УДАЛИ В РУЧНУЮ!                                                                ║
║ {YELLOW}НЕ ЗАБУДЬ ЗАКРЫТЬ ЗАДАЧУ "ВЫКЛАДКА КАТАЛОГА"{RESET}                                                                         ║
╚======================================================================================================================╝'''


